####################
## Taps            #
####################
tap "caarlos0/tap"
tap "domt4/autoupdate"
tap "github/gh"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "mveritym/mel"
tap "buo/cask-upgrade"
tap "salesforce/policy_sentry"
tap "aws/tap"
tap "homebrew/cask-drivers"


####################
## Formulae        #
####################
brew "act"
brew "awscli"
brew "bat"
brew "ec2-metadata-mock"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "jq"
brew "kustomize"
brew "make"
brew "mas"
brew "mveritym/mel/kubedecode"
brew "node", link: false
brew "policy_sentry"
brew "pure"
brew "shellcheck"
brew "sshuttle"
# brew "telnet"
brew "transcrypt"
brew "tree"
brew "volta"
brew "yadm"
brew "yarn"
brew "yq"
brew "zero-sh/tap/zero"
brew "zsh-syntax-highlighting"


####################
## HashiCorp       #
####################
brew "hashicorp/tap/boundary"
brew "hashicorp/tap/consul"
# brew hashicorp/tap/consul-template
# brew hashicorp/tap/consul-terraform-sync
brew "hashicorp/tap/nomad"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/sentinel"
brew "hashicorp/tap/terraform"
# brew "vagrant"
brew "hashicorp/tap/vault"
brew "hashicorp/tap/waypoint"
cask "hashicorp/tap/hashicorp-boundary-desktop"


####################
## Casks           #
####################
cask "iterm2"
cask "authy"
cask "docker"
cask "github"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive"
cask "krisp"
cask "parallels"
cask "postman"
cask "session-manager-plugin"
cask "saleae-logic"
cask "slack"
cask "spotify"
cask "SuperSlicer"
cask "typora"
cask "powershell"
cask "virtualbox"
cask "visual-studio-code"
# cask "zoom"


####################
## Mac App Store   #
####################
mas "Magnet", id: 441258766
mas "Xcode", id: 497799835
