####################
## Taps            #
####################
tap "caarlos0/tap"
tap "domt4/autoupdate"
tap "github/gh"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "mveritym/mel"
tap "buo/cask-upgrade"
tap "salesforce/policy_sentry"
tap "aws/tap"
tap "homebrew/cask-drivers"


#################################
## Bootstrapping                #
## Needed for this repo to work #
#################################
brew "mas" # mac app store
brew "zero-sh/tap/zero"
brew "yadm" # yet another dotfile manager

####################
## Shell           #
####################
cask "iterm2"
brew "bat"
brew "fzf"
brew "shellcheck"
brew "sshuttle"
brew "yq"
brew "tree"
brew "zsh-syntax-highlighting"
cask "session-manager-plugin"

####################
## Dev Env         #
####################
brew "act"
brew "awscli"
brew "gh"
brew "git"
brew "git-lfs"
brew "jq"
cask "docker"
cask "visual-studio-code"
cask "github"
cask "postman"
brew "gnupg"
brew "policy_sentry"

####################
## JS/TS           #
####################
brew "node", link: false
brew "yarn"

####################
## Apps & Utils    #
####################
cask "authy"
cask "krisp"
cask "spotify"
cask "typora"
cask "logi-options-plus" # for logitech mx master mouse

####################
## HashiCorp       #
####################
# brew "hashicorp/tap/boundary"
brew "hashicorp/tap/consul"
# brew hashicorp/tap/consul-template
# brew hashicorp/tap/consul-terraform-sync
brew "hashicorp/tap/nomad"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/sentinel"
brew "hashicorp/tap/terraform"
# brew "vagrant"
brew "hashicorp/tap/vault"
brew "hashicorp/tap/waypoint"
cask "hashicorp/tap/hashicorp-boundary-desktop"


####################
## Mac App Store   #
####################
mas "Magnet", id: 441258766
mas "Xcode", id: 497799835



####################################
## TBD/Installed a different way   #
####################################
# cask "google-cloud-sdk"
# cask "powershell"
# cask "virtualbox"
# cask "parallels"
# cask "slack"
# cask "zoom"
#
## Home
# cask "SuperSlicer"
# cask "saleae-logic"
# cask "google-chrome"
# cask "google-drive"
#
## Slated for archival
# brew "make" # managed via Roam, maybe?
# brew "ec2-metadata-mock"
# brew "kustomize"
# brew "mveritym/mel/kubedecode"
# brew "pure"
# brew "telnet"
# brew "transcrypt"
# brew "volta"
